In [81]:
import pandas as pd
import os

#read file into pandas and create dataframe

data = "purchase_data2.json"
data_df = pd.read_json(data)
data_df.head()

   Age Gender  Item ID                 Item Name  Price          SN
0   20   Male       93  Apocalyptic Battlescythe   4.49     Iloni35
1   21   Male       12                     Dawne   3.36   Aidaira26
2   17   Male        5                Putrid Fan   2.63      Irim47
3   17   Male      123         Twilight's Carver   2.55     Irith83
4   22   Male      154              Feral Katana   4.11  Philodil43

In [82]:
#player count

frame_df = pd.DataFrame({"Total Players":[data_df["SN"].nunique()]})
frame_df

   Total Players
0             74

In [83]:
purch_df = pd.DataFrame({
    "Number of Unique Items":[data_df["Item Name"].nunique()],
    "Average Price":[data_df["Price"].mean()],
    "Number of Purchases":[data_df["Item ID"].count()],
    "Total Revenue":[data_df["Price"].sum()]
})
purch_df

   Average Price  Number of Purchases  Number of Unique Items  Total Revenue
0       2.924359                   78                      63          228.1

In [80]:
#purchasing analysis

In [ ]:
#gender demographics